# Rampart flats

This notebook's a convenient local development tool integrated with python interpreter, interactive browser-based text editor and preliminary started local PostgreSQL DB. Feel free to use this document to easily explore databases filled with [rampart](https://github.com/xXxRisingTidexXx/rampart) miners & parsers. Happy coding!

In [1]:
from warnings import filterwarnings
from pandas import read_sql, DataFrame
from sqlalchemy import create_engine
from shapely.wkb import loads
from numpy import array
from scipy.spatial.distance import cdist
from sklearn.preprocessing import RobustScaler
filterwarnings('ignore', message='numpy.dtype size changed')
filterwarnings('ignore', message='numpy.ufunc size changed')

<br />Lets load the whole *flats* table from the DB. Notice that the hostname equals the DB container name due to the common Docker network.

In [2]:
engine = create_engine('postgres://postgres:postgres@rampart-database:5432/rampart')

In [3]:
with engine.connect() as connection:
    flats = read_sql(
        '''
        select id, 
               price, 
               total_area, 
               living_area, 
               kitchen_area, 
               room_number, 
               floor, 
               total_floor, 
               housing, 
               complex, 
               st_x(point) as longitude,
               st_y(point) as latitude,
               state, 
               city
        from flats
        ''', 
        connection, 
        index_col=['id']
    )

In [4]:
flats.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 61266 entries, 1 to 61266
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   price         61266 non-null  float64
 1   total_area    61266 non-null  float64
 2   living_area   61266 non-null  float64
 3   kitchen_area  61266 non-null  float64
 4   room_number   61266 non-null  int64
 5   floor         61266 non-null  int64
 6   total_floor   61266 non-null  int64
 7   housing       61266 non-null  object
 8   complex       61266 non-null  object
 9   longitude     61266 non-null  float64
 10  latitude      61266 non-null  float64
 11  state         61266 non-null  object
 12  city          61266 non-null  object
dtypes: float64(6), int64(3), object(4)
memory usage: 6.5+ MB

In [5]:
flats.describe()

,price,total_area,living_area,kitchen_area,room_number,floor,total_floor,longitude,latitude
count,6.126600e+04,61266.000000,61266.000000,61266.000000,61266.000000,61266.000000,61266.000000,61266.000000,61266.000000
mean,9.198933e+04,69.464737,22.675430,10.935118,1.994320,8.150328,15.135165,30.082875,49.154742
std,1.982127e+05,35.901090,25.224309,9.638400,0.955263,6.200472,7.845294,2.607084,1.657275
min,3.800000e+01,14.000000,0.000000,0.000000,1.000000,1.000000,2.000000,22.211671,30.344830
25%,3.450000e+04,45.000000,0.000000,0.000000,1.000000,3.000000,9.000000,30.279608,47.119428
50%,5.519950e+04,62.000000,18.000000,11.000000,2.000000,6.000000,14.000000,30.530162,50.042410
75%,1.000000e+05,81.990000,36.000000,15.500000,3.000000,11.000000,24.000000,30.728073,50.434751
max,3.269808e+07,555.000000,485.000000,130.000000,9.000000,39.000000,50.000000,50.466270,51.889167

<br />Now lets explore the entire data frame contents closer. To begin with, housing:

In [6]:
flats.groupby(['housing'])['housing'].count().reset_index(name='count')

     housing  count
0    primary  33121
1  secondary  28145

<br />Now, states:

In [7]:
states = flats.groupby(['state'])['state'].count().reset_index(name='count').sort_values(['count'], ascending=False, ignore_index=True)

In [8]:
print(f'Found {len(states)} states, {len(states[states["count"] < 100])} out of them seem to be insufficient.')

Found 35 states, 16 out of them seem to be insufficient.

In [9]:
states[states['count'] > 1000]

                       state  count
0           Київська область  29340
1            Одеська область  14939
2  Івано-Франківська область   3844
3         Харківська область   2617
4          Вінницька область   2383
5          Львівська область   1705
6   Дніпропетровська область   1666
7        Хмельницька область   1310

<br />Now we should count cities.

In [10]:
cities = flats.groupby(['city'])['city'].count().reset_index(name='count').sort_values(['count'], ascending=False, ignore_index=True)

In [11]:
print(f'Found {len(cities)} cities, {len(cities[cities["count"] < 100])} out of them seem to be insufficient.')

Found 187 cities, 163 out of them seem to be insufficient.

In [12]:
cities[cities['count'] > 1000]

                  city  count
0                 Київ  23713
1                Одеса  14764
2     Івано-Франківськ   3798
3               Ірпінь   3202
4               Харків   2608
5              Вінниця   2366
6                Львів   1642
7  Києво-Святошинський   1543
8               Дніпро   1396
9         Хмельницький   1223

<br />A quick look on housing complexes.

In [13]:
print(f'{len(flats[(flats["housing"] == "primary") & (flats["complex"] != "")])} primary flats have complexes.')

18530 primary flats have complexes.

In [14]:
print(f'{len(flats[(flats["housing"] == "secondary") & (flats["complex"] != "")])} secondary flats have complexes.')

5422 secondary flats have complexes.

In [15]:
print(f'{len(flats[flats["complex"] == ""])} flats have no complexes.')

37314 flats have no complexes.

In [16]:
(
    flats[flats['complex'] != '']
    .drop_duplicates('complex')
    .groupby('city')['city']
    .count().reset_index(name='count')
    .sort_values(['count'], ascending=False, ignore_index=True)
    .head(10)
)

                  city  count
0                Одеса    255
1                 Київ    243
2                Львів     99
3               Ірпінь     76
4               Харків     71
5     Івано-Франківськ     67
6         Хмельницький     58
7  Києво-Святошинський     54
8              Вінниця     51
9               Дніпро     45

<br />Now it's the very time to explore the numerical data.

In [17]:
defacto = (
    flats[(flats['housing'] == 'primary') & (flats['city'] == 'Київ')]
    .drop(columns=['total_area', 'living_area', 'kitchen_area', 'floor', 'total_floor', 'housing', 'complex', 'state', 'city'])
)
scaler = RobustScaler(quantile_range=(25, 75))
scaler.fit(defacto)
features = scaler.transform(defacto)
preferences = scaler.transform(array([[30000, 1, 30.525688, 50.418102]]))
weights = array([0.07, 0.23, 0.35, 0.35])
defacto['cosine'] = cdist(features, preferences, 'cosine')
defacto['euclidean'] = cdist(features, preferences, 'euclidean')
print(defacto.sort_values('cosine').head(5))
print(defacto.sort_values('euclidean').head(5))

         price  room_number  longitude   latitude    cosine  euclidean
id
28156  20500.0            1  30.500292  50.411051  0.034574   0.273141
28577  20185.0            1  30.500292  50.411051  0.034671   0.275877
6467   30000.0            1  30.500292  50.411051  0.035673   0.228736
28513  39500.0            1  30.498217  50.419964  0.039352   0.253301
11975  30500.0            1  30.569682  50.420129  0.059096   0.325220
         price  room_number  longitude   latitude    cosine  euclidean
id
6467   30000.0            1  30.500292  50.411051  0.035673   0.228736
28513  39500.0            1  30.498217  50.419964  0.039352   0.253301
28156  20500.0            1  30.500292  50.411051  0.034574   0.273141
28577  20185.0            1  30.500292  50.411051  0.034671   0.275877
6585   34550.0            1  30.516898  50.433822  0.068339   0.310869